TrampolineRTOS/trampoline/machines/cortex-m/armv7em/efm32wg/emlib/inc/em_ebi.h
/***************************************************************************//**
 * @file em_ebi.h
 * @brief External Bus Iterface (EBI) peripheral API
 * @version 5.2.2
 *******************************************************************************
 * # License
 * <b>Copyright 2016 Silicon Laboratories, Inc. http://www.silabs.com</b>
 *******************************************************************************
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Silicon Labs has no
 * obligation to support this Software. Silicon Labs is providing the
 * Software "AS IS", with no express or implied warranties of any kind,
 * including, but not limited to, any implied warranties of merchantability
 * or fitness for any particular purpose or warranties against infringement
 * of any proprietary rights of a third party.
 *
 * Silicon Labs will not be liable for any consequential, incidental, or
 * special damages, or any other relief, or for any claim by any third party,
 * arising from your use of this Software.
 *
 ******************************************************************************/

#ifndef EM_EBI_H
#define EM_EBI_H

#include "em_device.h"
#if defined(EBI_COUNT) && (EBI_COUNT > 0)

#include <stdint.h>
#include <stdbool.h>
#include "em_assert.h"

#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************//**
 * @addtogroup emlib
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup EBI
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * @verbatim
 *
 * ---------               ---------
 * |       |  /|       |\  | Ext.  |
 * |  EBI  | / --------- \ | Async |
 * |       | \ --------- / | Device|
 * |       |  \|       |/  |       |
 * ---------               ---------
 *         Parallel interface
 *
 * @endverbatim
 ******************************************************************************/

/*******************************************************************************
 *******************************   DEFINES   ***********************************
 ******************************************************************************/

#define EBI_BANK0    (uint32_t)(1 << 1) /**< EBI address bank 0 */
#define EBI_BANK1    (uint32_t)(1 << 2) /**< EBI address bank 1 */
#define EBI_BANK2    (uint32_t)(1 << 3) /**< EBI address bank 2 */
#define EBI_BANK3    (uint32_t)(1 << 4) /**< EBI address bank 3 */

#define EBI_CS0      (uint32_t)(1 << 1) /**< EBI chip select line 0 */
#define EBI_CS1      (uint32_t)(1 << 2) /**< EBI chip select line 1 */
#define EBI_CS2      (uint32_t)(1 << 3) /**< EBI chip select line 2 */
#define EBI_CS3      (uint32_t)(1 << 4) /**< EBI chip select line 3 */

#if defined(_EBI_ROUTE_MASK) && defined(_EBI_ROUTE_APEN_MASK)
#define EBI_GENERIC_ALB_A0     EBI_ROUTE_ALB_A0
#define EBI_GENERIC_ALB_A8     EBI_ROUTE_ALB_A8
#define EBI_GENERIC_ALB_A16    EBI_ROUTE_ALB_A16
#define EBI_GENERIC_ALB_A24    EBI_ROUTE_ALB_A24
#define EBI_GENERIC_APEN_A0    EBI_ROUTE_APEN_A0
#define EBI_GENERIC_APEN_A5    EBI_ROUTE_APEN_A5
#define EBI_GENERIC_APEN_A6    EBI_ROUTE_APEN_A6
#define EBI_GENERIC_APEN_A7    EBI_ROUTE_APEN_A7
#define EBI_GENERIC_APEN_A8    EBI_ROUTE_APEN_A8
#define EBI_GENERIC_APEN_A9    EBI_ROUTE_APEN_A9
#define EBI_GENERIC_APEN_A10   EBI_ROUTE_APEN_A10
#define EBI_GENERIC_APEN_A11   EBI_ROUTE_APEN_A11
#define EBI_GENERIC_APEN_A12   EBI_ROUTE_APEN_A12
#define EBI_GENERIC_APEN_A13   EBI_ROUTE_APEN_A13
#define EBI_GENERIC_APEN_A14   EBI_ROUTE_APEN_A14
#define EBI_GENERIC_APEN_A15   EBI_ROUTE_APEN_A15
#define EBI_GENERIC_APEN_A16   EBI_ROUTE_APEN_A16
#define EBI_GENERIC_APEN_A17   EBI_ROUTE_APEN_A17
#define EBI_GENERIC_APEN_A18   EBI_ROUTE_APEN_A18
#define EBI_GENERIC_APEN_A19   EBI_ROUTE_APEN_A19
#define EBI_GENERIC_APEN_A20   EBI_ROUTE_APEN_A20
#define EBI_GENERIC_APEN_A21   EBI_ROUTE_APEN_A21
#define EBI_GENERIC_APEN_A22   EBI_ROUTE_APEN_A22
#define EBI_GENERIC_APEN_A23   EBI_ROUTE_APEN_A23
#define EBI_GENERIC_APEN_A24   EBI_ROUTE_APEN_A24
#define EBI_GENERIC_APEN_A25   EBI_ROUTE_APEN_A25
#define EBI_GENERIC_APEN_A26   EBI_ROUTE_APEN_A26
#define EBI_GENERIC_APEN_A27   EBI_ROUTE_APEN_A27
#define EBI_GENERIC_APEN_A28   EBI_ROUTE_APEN_A28
#elif defined(_EBI_ROUTEPEN_MASK)
#define EBI_GENERIC_ALB_A0     EBI_ROUTEPEN_ALB_A0
#define EBI_GENERIC_ALB_A8     EBI_ROUTEPEN_ALB_A8
#define EBI_GENERIC_ALB_A16    EBI_ROUTEPEN_ALB_A16
#define EBI_GENERIC_ALB_A24    EBI_ROUTEPEN_ALB_A24
#define EBI_GENERIC_APEN_A0    EBI_ROUTEPEN_APEN_A0
#define EBI_GENERIC_APEN_A5    EBI_ROUTEPEN_APEN_A5
#define EBI_GENERIC_APEN_A6    EBI_ROUTEPEN_APEN_A6
#define EBI_GENERIC_APEN_A7    EBI_ROUTEPEN_APEN_A7
#define EBI_GENERIC_APEN_A8    EBI_ROUTEPEN_APEN_A8
#define EBI_GENERIC_APEN_A9    EBI_ROUTEPEN_APEN_A9
#define EBI_GENERIC_APEN_A10   EBI_ROUTEPEN_APEN_A10
#define EBI_GENERIC_APEN_A11   EBI_ROUTEPEN_APEN_A11
#define EBI_GENERIC_APEN_A12   EBI_ROUTEPEN_APEN_A12
#define EBI_GENERIC_APEN_A13   EBI_ROUTEPEN_APEN_A13
#define EBI_GENERIC_APEN_A14   EBI_ROUTEPEN_APEN_A14
#define EBI_GENERIC_APEN_A15   EBI_ROUTEPEN_APEN_A15
#define EBI_GENERIC_APEN_A16   EBI_ROUTEPEN_APEN_A16
#define EBI_GENERIC_APEN_A17   EBI_ROUTEPEN_APEN_A17
#define EBI_GENERIC_APEN_A18   EBI_ROUTEPEN_APEN_A18
#define EBI_GENERIC_APEN_A19   EBI_ROUTEPEN_APEN_A19
#define EBI_GENERIC_APEN_A20   EBI_ROUTEPEN_APEN_A20
#define EBI_GENERIC_APEN_A21   EBI_ROUTEPEN_APEN_A21
#define EBI_GENERIC_APEN_A22   EBI_ROUTEPEN_APEN_A22
#define EBI_GENERIC_APEN_A23   EBI_ROUTEPEN_APEN_A23
#define EBI_GENERIC_APEN_A24   EBI_ROUTEPEN_APEN_A24
#define EBI_GENERIC_APEN_A25   EBI_ROUTEPEN_APEN_A25
#define EBI_GENERIC_APEN_A26   EBI_ROUTEPEN_APEN_A26
#define EBI_GENERIC_APEN_A27   EBI_ROUTEPEN_APEN_A27
#define EBI_GENERIC_APEN_A28   EBI_ROUTEPEN_APEN_A28
#endif

